# Пользователь вводит число с клавиатуры.
# Необходимо разложить число на разряды при помощи цикла while.
# num = int(input())
# while num:
#     print(num % 10)
#     num //= 10